Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ule.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["CLOUDFLARE_UPLOAD_KEY"]: Refreshing state... [id=/ecs/api-journeys/prod/CLOUDFLARE_UPLOAD_KEY]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["GROWTH_SPACES_URL"]: Refreshing state... [id=/ecs/api-journeys/prod/GROWTH_SPACES_URL]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["GATEWAY_HMAC_SECRET"]: Refreshing state... [id=/ecs/api-journeys/prod/GATEWAY_HMAC_SECRET]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["POWER_BI_JOURNEYS_SINGLE_SUMMARY_REPORT_ID"]: Refreshing state... [id=/ecs/api-journeys/prod/POWER_BI_JOURNEYS_SINGLE_SUMMARY_REPORT_ID]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["PLAUSIBLE_API_KEY"]: Refreshing state... [id=/ecs/api-journeys/prod/PLAUSIBLE_API_KEY]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["VERCEL_TOKEN"]: Refreshing state... [id=/ecs/api-journeys/prod/VERCEL_TOKEN]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["GIT_BRANCH"]: Refreshing state... [id=/ecs/api-journeys/prod/GIT_BRANCH]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["PG_DATABASE_URL_JOURNEYS"]: Refreshing state... [id=/ecs/api-journeys/prod/PG_DATABASE_URL_JOURNEYS]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ssm_parameter.parameters["FIREBASE_API_KEY"]: Refreshing state... [id=/ecs/api-journeys/prod/FIREBASE_API_KEY]
module.stage.module.api-languages.module.ecs-task.aws_route53_record.record: Refreshing state... [id=Z056780738DT3AZL6A4WD_api-languages_CNAME]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["ARCLIGHT_API_KEY"]: Refreshing state... [id=/ecs/api-languages/prod/ARCLIGHT_API_KEY]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["ARCLIGHT_V3_URL"]: Refreshing state... [id=/ecs/api-languages/prod/ARCLIGHT_V3_URL]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["CLOUDFLARE_R2_ENDPOINT"]: Refreshing state... [id=/ecs/api-languages/prod/CLOUDFLARE_R2_ENDPOINT]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["ALGOLIA_API_KEY_LANGUAGES"]: Refreshing state... [id=/ecs/api-languages/prod/ALGOLIA_API_KEY_LANGUAGES]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["ALGOLIA_APPLICATION_ID"]: Refreshing state... [id=/ecs/api-languages/prod/ALGOLIA_APPLICATION_ID]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["REDIS_PORT"]: Refreshing state... [id=/ecs/api-languages/prod/REDIS_PORT]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["CLOUDFLARE_R2_BUCKET"]: Refreshing state... [id=/ecs/api-languages/prod/CLOUDFLARE_R2_BUCKET]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["CLOUDFLARE_R2_SECRET"]: Refreshing state... [id=/ecs/api-languages/prod/CLOUDFLARE_R2_SECRET]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["GATEWAY_HMAC_SECRET"]: Refreshing state... [id=/ecs/api-languages/prod/GATEWAY_HMAC_SECRET]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["CLOUDFLARE_R2_ACCESS_KEY_ID"]: Refreshing state... [id=/ecs/api-languages/prod/CLOUDFLARE_R2_ACCESS_KEY_ID]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["WESS_API_TOKEN"]: Refreshing state... [id=/ecs/api-languages/prod/WESS_API_TOKEN]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["ALGOLIA_INDEX_COUNTRIES"]: Refreshing state... [id=/ecs/api-languages/prod/ALGOLIA_INDEX_COUNTRIES]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["PG_DATABASE_URL_LANGUAGES"]: Refreshing state... [id=/ecs/api-languages/prod/PG_DATABASE_URL_LANGUAGES]
module.prod.module.api-languages.module.ecs-task.aws_ssm_parameter.parameters["REDIS_URL"]: Refreshing state... [id=/ecs/api-languages/prod/REDIS_URL]
module.prod.module.journeys-admin.module.ecs-task.data.aws_route53_zone.zone: Reading...
module.stage.module.api-users.module.ecs-task.data.aws_route53_zone.zone: Reading...
module.prod.module.journeys-admin.module.ecs-task.data.aws_route53_zone.zone: Read complete after 0s [id=Z06687872LMUIKS0Y291P]
module.stage.module.arclight.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=arclight-stage-logs]
module.stage.module.arclight.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/arclight-stage-tg/9801b0e48900f188]
module.stage.module.api-users.module.ecs-task.aws_route53_record.record: Refreshing state... [id=Z056780738DT3AZL6A4WD_api-users_CNAME]
module.stage.module.api-users.module.ecs-task.data.aws_route53_zone.zone: Read complete after 0s [id=Z056780738DT3AZL6A4WD]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["REDIS_URL"]: Refreshing state... [id=/ecs/api-users/stage/REDIS_URL]
module.stage.module.journeys-admin.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=journeys-admin-stage-logs]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["REDIS_PORT"]: Refreshing state... [id=/ecs/api-users/stage/REDIS_PORT]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["GOOGLE_APPLICATION_JSON"]: Refreshing state... [id=/ecs/api-users/stage/GOOGLE_APPLICATION_JSON]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["JOURNEYS_ADMIN_URL"]: Refreshing state... [id=/ecs/api-users/stage/JOURNEYS_ADMIN_URL]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["JESUS_FILM_PROJECT_VERIFY_URL"]: Refreshing state... [id=/ecs/api-users/stage/JESUS_FILM_PROJECT_VERIFY_URL]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["EXAMPLE_EMAIL_TOKEN"]: Refreshing state... [id=/ecs/api-users/stage/EXAMPLE_EMAIL_TOKEN]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["GATEWAY_HMAC_SECRET"]: Refreshing state... [id=/ecs/api-users/stage/GATEWAY_HMAC_SECRET]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["PG_DATABASE_URL_USERS"]: Refreshing state... [id=/ecs/api-users/stage/PG_DATABASE_URL_USERS]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=/ecs/api-users/stage/AWS_SECRET_ACCESS_KEY]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["INTEROP_TOKEN"]: Refreshing state... [id=/ecs/api-users/stage/INTEROP_TOKEN]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["SMTP_URL"]: Refreshing state... [id=/ecs/api-users/stage/SMTP_URL]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=/ecs/api-users/stage/AWS_ACCESS_KEY_ID]
module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["NAT_ADDRESSES"]: Refreshing state... [id=/ecs/api-users/stage/NAT_ADDRESSES]
module.prod.module.journeys-admin.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/journeys-admin-prod-tg/6aa1c516ad31ba99]
module.prod.module.journeys-admin.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=journeys-admin-prod-logs]
module.stage.module.api-gateway-stage.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-gateway-stage-tg/66c0a0a1eb2426f2]
module.stage.module.api-gateway-stage.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-gateway-stage-logs]
module.stage.module.journeys-admin.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/journeys-admin-stage-tg/f038b11b474ddf07]
module.stage.module.cms.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/cms-stage-tg/3253bc770843fe67]
module.stage.module.cms.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=cms-stage-logs]
module.prod.module.api-gateway.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-gateway-prod-tg/8e98aac31a68fba7]
module.prod.module.api-gateway.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-gateway-prod-logs]
module.stage.module.api-analytics.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-analytics-stage-tg/be8b43b0ab9e7d8e]
module.prod.module.api-journeys-modern.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-journeys-modern-prod-tg/e7c6a66de0c2ff29]
module.stage.module.api-analytics.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-analytics-stage-logs]
module.prod.module.api-journeys-modern.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-journeys-modern-prod-logs]
module.prod.module.api-media.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-media-prod-tg/7482c4be82f35024]
module.prod.module.api-journeys.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-journeys-prod-tg/eab635e76d16d9d8]
module.prod.module.api-media.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-media-prod-logs]
module.prod.module.api-users.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-users-prod-logs]
module.prod.module.api-journeys.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-journeys-prod-logs]
module.prod.module.api-users.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-users-prod-tg/62172f59861c5804]
module.prod.module.api-languages.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-languages-prod-tg/f662bd85bf3c73ff]
module.prod.module.api-languages.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-languages-prod-logs]
module.prod.module.api-analytics.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-analytics-prod-logs]
module.prod.module.cms.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/cms-prod-tg/558eae36912ff7d4]
module.prod.module.arclight.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=arclight-prod-logs]
module.prod.module.api-analytics.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-analytics-prod-tg/0c14a7e1e9a640f0]
module.prod.module.cms.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=cms-prod-logs]
module.prod.module.arclight.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/arclight-prod-tg/b112722586e76658]
module.stage.module.api-media.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-media-stage-logs]
module.stage.module.api-media.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-media-stage-tg/b9437ddfaa9712e6]
module.stage.module.api-journeys.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-journeys-stage-tg/cf9d8bdda9dcf52e]
module.stage.module.api-journeys.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-journeys-stage-logs]
module.stage.module.api-languages.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-languages-stage-logs]
module.stage.module.api-languages.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-languages-stage-tg/67e1d5c015f4bfff]
module.stage.module.api-journeys-modern.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-journeys-modern-stage-logs]
module.stage.module.api-journeys-modern.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-journeys-modern-stage-tg/f8283fcf2e46f90d]
module.stage.module.arclight.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-arclight-stage]
module.stage.module.arclight.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-public-alb-stage/27d94355c709eb16/e976ba0cdd6d17a6/793797b631015e92]
module.prod.module.journeys-admin.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-journeys-admin-prod]
module.stage.module.journeys-admin.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-journeys-admin-stage]
module.stage.module.api-users.module.ecs-task.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:targetgroup/api-users-stage-tg/08e36721eab4736f]
module.stage.module.cms.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-cms-stage]
module.stage.module.api-users.module.ecs-task.aws_cloudwatch_log_group.ecs_cw_log_group: Refreshing state... [id=api-users-stage-logs]
module.prod.module.journeys-admin.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-public-alb-prod/7cf1f0916ed2c660/baff3356faf3dfae/4b06c3bc6bedf3a1]
module.stage.module.api-gateway-stage.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-public-alb-stage/27d94355c709eb16/e976ba0cdd6d17a6/70fb193fd1fecbd9]
module.stage.module.api-gateway-stage.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-gateway-stage]
module.prod.module.api-gateway.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-gateway-prod]
module.stage.module.journeys-admin.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-public-alb-stage/27d94355c709eb16/e976ba0cdd6d17a6/edc105209fe56999]
module.stage.module.api-analytics.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-analytics-stage]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-journeys-modern-prod]
module.stage.module.cms.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-public-alb-stage/27d94355c709eb16/e976ba0cdd6d17a6/78b1efc27e185d01]
module.prod.module.api-gateway.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-public-alb-prod/7cf1f0916ed2c660/baff3356faf3dfae/865121b01439cbfc]
module.prod.module.api-media.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-media-prod]
module.prod.module.api-journeys.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-journeys-prod]
module.stage.module.api-analytics.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-stage/846f69021da58f87/fedc8d8232ec85b6/13fe7274ce32ff4d]
module.prod.module.api-analytics.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-analytics-prod]
module.prod.module.api-users.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-users-prod]
module.prod.module.api-languages.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-languages-prod]
module.prod.module.cms.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-cms-prod]
module.prod.module.arclight.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-arclight-prod]
module.prod.module.cms.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-public-alb-prod/7cf1f0916ed2c660/baff3356faf3dfae/02c9778953c343ed]
module.stage.module.api-journeys.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-journeys-stage]
module.stage.module.api-media.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-media-stage]
module.prod.module.arclight.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-public-alb-prod/7cf1f0916ed2c660/baff3356faf3dfae/b310a1d9152e585f]
module.prod.module.api-journeys-modern.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-prod/ae1556aacf21465f/bbe2cf245725e2e0/5159512f7454d864]
module.stage.module.api-media.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-stage/846f69021da58f87/390fbc642c8c262c/d029c6eefafa6681]
module.stage.module.api-languages.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-languages-stage]
module.stage.module.api-journeys-modern.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-journeys-modern-stage]
module.prod.module.api-analytics.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-prod/ae1556aacf21465f/5c1cbf8d53e4cfc0/ee4e400d297efa8c]
module.prod.module.api-languages.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-prod/ae1556aacf21465f/c26ce743dd562c38/393214d0be46d152]
module.stage.module.api-journeys.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-stage/846f69021da58f87/2772aabe58647566/f5761935d552e4c6]
module.prod.module.api-media.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-prod/ae1556aacf21465f/8dd57a2792b0a37a/b885faf1d8b97520]
module.prod.module.api-journeys.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-prod/ae1556aacf21465f/d5fde78dea7a53d6/f376b7543d998c45]
module.stage.module.api-languages.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-stage/846f69021da58f87/f8bb656979069fe6/5d55068a5abd3f17]
module.prod.module.api-users.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-prod/ae1556aacf21465f/d812a47be4e206fe/57f9b2a3e9e0d79b]
module.stage.module.api-journeys-modern.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-stage/846f69021da58f87/cb0cf76c98f56c69/63bb0847ee74d6cf]
module.stage.module.arclight.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-arclight-stage]
module.stage.module.arclight.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-arclight-stage]
module.prod.module.journeys-admin.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-journeys-admin-prod]
module.stage.module.api-users.module.ecs-task.aws_ecr_repository.ecr_repository: Refreshing state... [id=jfp-api-users-stage]
module.prod.module.journeys-admin.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-journeys-admin-prod]
module.stage.module.journeys-admin.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-journeys-admin-stage]
module.stage.module.journeys-admin.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-journeys-admin-stage]
module.stage.module.cms.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-cms-stage]
module.stage.module.cms.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-cms-stage]
module.stage.module.api-users.module.ecs-task.aws_alb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:410965620680:listener-rule/app/jfp-internal-alb-stage/846f69021da58f87/418b774d47b90b2e/afefbfc71ceb373a]
module.stage.module.api-gateway-stage.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-gateway-stage]
module.prod.module.api-gateway.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-gateway-prod]
module.stage.module.api-gateway-stage.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-gateway-stage]
module.prod.module.api-gateway.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-gateway-prod]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-journeys-modern-prod]
module.stage.module.api-analytics.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-analytics-stage]
module.stage.module.api-analytics.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-analytics-stage]
module.prod.module.api-journeys.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-journeys-prod]
module.prod.module.api-media.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-media-prod]
module.prod.module.api-journeys.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-journeys-prod]
module.prod.module.api-media.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-media-prod]
module.prod.module.api-analytics.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-analytics-prod]
module.prod.module.api-users.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-users-prod]
module.prod.module.api-languages.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-languages-prod]
module.prod.module.api-analytics.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-analytics-prod]
module.prod.module.cms.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-cms-prod]
module.prod.module.cms.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-cms-prod]
module.stage.module.api-journeys.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-journeys-stage]
module.stage.module.api-media.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-media-stage]
module.prod.module.arclight.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-arclight-prod]
module.stage.module.api-media.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-media-stage]
module.stage.module.api-languages.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-languages-stage]
module.stage.module.api-languages.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-languages-stage]
module.prod.module.journeys-admin.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/journeys-admin-prod-service]
module.stage.module.arclight.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/arclight-stage-service]
module.stage.module.api-journeys-modern.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-journeys-modern-stage]
module.stage.module.api-journeys-modern.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-journeys-modern-stage]
module.stage.module.api-users.module.ecs-task.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=jfp-api-users-stage]
module.stage.module.api-users.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-users-stage]
module.stage.module.journeys-admin.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/journeys-admin-stage-service]
module.prod.module.api-gateway.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-gateway-prod-service]
module.stage.module.cms.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/cms-stage-service]
module.stage.module.api-analytics.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-analytics-stage-service]
module.stage.module.api-gateway-stage.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-gateway-stage-service]
module.prod.module.api-journeys.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-journeys-prod-service]
module.prod.module.cms.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/cms-prod-service]
module.prod.module.api-media.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-media-prod-service]
module.prod.module.api-analytics.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-analytics-prod-service]
module.stage.module.api-media.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-media-stage-service]
module.stage.module.api-journeys-modern.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-journeys-modern-stage-service]
module.stage.module.api-users.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-users-stage-service]
module.stage.module.api-languages.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-languages-stage-service]
module.stage.module.arclight.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/arclight-stage-service]
module.stage.module.journeys-admin.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/journeys-admin-stage-service]
module.prod.module.journeys-admin.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/journeys-admin-prod-service]
module.prod.module.api-gateway.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/api-gateway-prod-service]
module.stage.module.cms.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/cms-stage-service]
module.stage.module.api-gateway-stage.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/api-gateway-stage-service]
module.stage.module.api-analytics.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/api-analytics-stage-service]
module.prod.module.api-journeys.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/api-journeys-prod-service]
module.prod.module.cms.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/cms-prod-service]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-journeys-modern-prod]
module.prod.module.api-media.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/api-media-prod-service]
module.stage.module.api-media.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/api-media-stage-service]
module.stage.module.api-journeys-modern.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/api-journeys-modern-stage-service]
module.stage.module.api-users.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/api-users-stage-service]
module.prod.module.api-analytics.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/api-analytics-prod-service]
module.stage.module.arclight.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.stage.module.arclight.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.prod.module.journeys-admin.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.prod.module.journeys-admin.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.stage.module.journeys-admin.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.stage.module.journeys-admin.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.prod.module.api-gateway.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.prod.module.api-gateway.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.stage.module.api-languages.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/api-languages-stage-service]
module.prod.module.api-media.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.prod.module.api-media.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.stage.module.cms.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.stage.module.api-gateway-stage.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.stage.module.api-gateway-stage.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.stage.module.api-analytics.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.stage.module.api-analytics.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.stage.module.cms.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.prod.module.cms.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.prod.module.cms.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.prod.module.api-journeys-modern.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-journeys-modern-prod-service]
module.stage.module.api-media.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.stage.module.api-media.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.stage.module.api-users.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.stage.module.api-users.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.stage.module.api-languages.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.stage.module.api-languages.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.prod.module.api-languages.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-languages-prod]
module.prod.module.api-journeys-modern.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/api-journeys-modern-prod-service]
module.stage.module.api-journeys-modern.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]
module.stage.module.api-journeys-modern.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.prod.module.api-languages.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-languages-prod-service]
module.prod.module.api-journeys-modern.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.prod.module.api-journeys-modern.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.prod.module.api-languages.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/api-languages-prod-service]
module.prod.module.api-languages.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.prod.module.api-languages.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.prod.module.api-analytics.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.prod.module.api-analytics.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.prod.module.api-journeys.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.prod.module.api-journeys.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.prod.module.arclight.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-arclight-prod]
module.prod.module.arclight.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/arclight-prod-service]
module.prod.module.arclight.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-prod/arclight-prod-service]
module.prod.module.arclight.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-prod]
module.prod.module.arclight.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-prod]
module.stage.module.api-journeys.module.ecs-task.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=jfp-api-journeys-stage]
module.stage.module.api-journeys.module.ecs-task.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-journeys-stage-service]
module.stage.module.api-journeys.module.ecs-task.aws_appautoscaling_target.service_autoscaling: Refreshing state... [id=service/jfp-ecs-cluster-stage/api-journeys-stage-service]
module.stage.module.api-journeys.module.ecs-task.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=jfp-cpu-autoscaling-stage]
module.stage.module.api-journeys.module.ecs-task.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=jfp-memory-autoscaling-stage]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform planned the following actions, but then encountered a problem:

  # module.prod.module.api-analytics.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-analytics-prod-service"
        name                               = "api-analytics-prod-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-analytics-prod:9" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.prod.module.api-analytics.module.ecs-task.aws_ecs_task_definition.ecs_task_definition must be replaced
+/- resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-analytics-prod:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-analytics-prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name             = "jfp-api-analytics-prod-app"
                  ~ secrets          = [
                      + {
                          + name      = "DD_API_KEY"
                          + valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                        {
                            name      = "GATEWAY_HMAC_SECRET"
                            valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-analytics/prod/GATEWAY_HMAC_SECRET"
                        },
                        # (1 unchanged element hidden)
                        {
                            name      = "PLAUSIBLE_SECRET_KEY_BASE"
                            valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-analytics/prod/PLAUSIBLE_SECRET_KEY_BASE"
                        },
                      - {
                          - name      = "PRISMA_LOCATION_ANALYTICS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-analytics/prod/PRISMA_LOCATION_ANALYTICS"
                        },
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                    ]
                  - systemControls   = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                  - cpu               = 0
                    name              = "jfp-api-analytics-prod-datadog-agent"
                  - systemControls    = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                  - cpu                   = 0
                    name                  = "jfp-api-analytics-prod-log-router"
                  - systemControls        = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "jfp-api-analytics-prod" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.prod.module.api-analytics.module.ecs-task.aws_ssm_parameter.parameters["PRISMA_LOCATION_ANALYTICS"] will be destroyed
  # (because key ["PRISMA_LOCATION_ANALYTICS"] is not in for_each map)
  - resource "aws_ssm_parameter" "parameters" {
      - arn             = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-analytics/prod/PRISMA_LOCATION_ANALYTICS" -> null
      - data_type       = "text" -> null
      - id              = "/ecs/api-analytics/prod/PRISMA_LOCATION_ANALYTICS" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/ecs/api-analytics/prod/PRISMA_LOCATION_ANALYTICS" -> null
      - overwrite       = true -> null
      - region          = "us-east-2" -> null
      - tags            = {
          - "name" = "PRISMA_LOCATION_ANALYTICS"
        } -> null
      - tags_all        = {
          - "name" = "PRISMA_LOCATION_ANALYTICS"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 3 -> null
        # (2 unchanged attributes hidden)
    }

  # module.prod.module.api-media.module.ecs-task.aws_appautoscaling_target.service_autoscaling will be updated in-place
  ~ resource "aws_appautoscaling_target" "service_autoscaling" {
        id                 = "service/jfp-ecs-cluster-prod/api-media-prod-service"
      ~ min_capacity       = 2 -> 1
        tags               = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod.module.api-media.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
      ~ desired_count                      = 2 -> 1
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-media-prod-service"
        name                               = "api-media-prod-service"
        tags                               = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.prod.module.arclight.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/arclight-prod-service"
        name                               = "arclight-prod-service"
        tags                               = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.stage.module.api-analytics.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-analytics-stage-service"
        name                               = "api-analytics-stage-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-analytics-stage:9" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.stage.module.api-analytics.module.ecs-task.aws_ecs_task_definition.ecs_task_definition must be replaced
+/- resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-analytics-stage:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-analytics-stage" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name             = "jfp-api-analytics-stage-app"
                  ~ secrets          = [
                      + {
                          + name      = "DD_API_KEY"
                          + valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                        {
                            name      = "GATEWAY_HMAC_SECRET"
                            valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-analytics/stage/GATEWAY_HMAC_SECRET"
                        },
                        # (1 unchanged element hidden)
                        {
                            name      = "PLAUSIBLE_SECRET_KEY_BASE"
                            valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-analytics/stage/PLAUSIBLE_SECRET_KEY_BASE"
                        },
                      - {
                          - name      = "PRISMA_LOCATION_ANALYTICS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-analytics/stage/PRISMA_LOCATION_ANALYTICS"
                        },
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                    ]
                  - systemControls   = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                  - cpu               = 0
                    name              = "jfp-api-analytics-stage-datadog-agent"
                  - systemControls    = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                  - cpu                   = 0
                    name                  = "jfp-api-analytics-stage-log-router"
                  - systemControls        = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "jfp-api-analytics-stage" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.stage.module.api-analytics.module.ecs-task.aws_ssm_parameter.parameters["PRISMA_LOCATION_ANALYTICS"] will be destroyed
  # (because key ["PRISMA_LOCATION_ANALYTICS"] is not in for_each map)
  - resource "aws_ssm_parameter" "parameters" {
      - arn             = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-analytics/stage/PRISMA_LOCATION_ANALYTICS" -> null
      - data_type       = "text" -> null
      - id              = "/ecs/api-analytics/stage/PRISMA_LOCATION_ANALYTICS" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/ecs/api-analytics/stage/PRISMA_LOCATION_ANALYTICS" -> null
      - overwrite       = true -> null
      - region          = "us-east-2" -> null
      - tags            = {
          - "name" = "PRISMA_LOCATION_ANALYTICS"
        } -> null
      - tags_all        = {
          - "name" = "PRISMA_LOCATION_ANALYTICS"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 3 -> null
        # (2 unchanged attributes hidden)
    }

  # module.stage.module.api-users.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-users-stage-service"
        name                               = "api-users-stage-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-users-stage:43" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.stage.module.api-users.module.ecs-task.aws_ecs_task_definition.ecs_task_definition must be replaced
+/- resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-users-stage:43" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-users-stage" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "SERVICE_ENV"
                          - value = "stage"
                        },
                      - {
                          - name  = "SERVICE_NAME"
                          - value = "api-users"
                        },
                    ]
                  - essential        = true
                  - image            = "410965620680.dkr.ecr.us-east-2.amazonaws.com/jfp-api-users-stage:latest"
                  - logConfiguration = {
                      - logDriver     = "awsfirelens"
                      - options       = {
                          - Host        = "http-intake.logs.datadoghq.com"
                          - Name        = "datadog"
                          - TLS         = "on"
                          - compress    = "gzip"
                          - dd_service  = "api-users"
                          - dd_source   = "graphql-yoga"
                          - dd_tags     = "env:stage"
                          - provider    = "ecs"
                          - retry_limit = "2"
                        }
                      - secretOptions = [
                          - {
                              - name      = "apikey"
                              - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                            },
                        ]
                    }
                  - memory           = 1024
                  - mountPoints      = []
                  - name             = "jfp-api-users-stage-app"
                  - portMappings     = [
                      - {
                          - containerPort = 4002
                          - hostPort      = 4002
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/AWS_ACCESS_KEY_ID"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/AWS_SECRET_ACCESS_KEY"
                        },
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                      - {
                          - name      = "EXAMPLE_EMAIL_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/EXAMPLE_EMAIL_TOKEN"
                        },
                      - {
                          - name      = "GATEWAY_HMAC_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/GATEWAY_HMAC_SECRET"
                        },
                      - {
                          - name      = "GOOGLE_APPLICATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/GOOGLE_APPLICATION_JSON"
                        },
                      - {
                          - name      = "INTEROP_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/INTEROP_TOKEN"
                        },
                      - {
                          - name      = "JESUS_FILM_PROJECT_VERIFY_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/JESUS_FILM_PROJECT_VERIFY_URL"
                        },
                      - {
                          - name      = "JOURNEYS_ADMIN_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/JOURNEYS_ADMIN_URL"
                        },
                      - {
                          - name      = "NAT_ADDRESSES"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/NAT_ADDRESSES"
                        },
                      - {
                          - name      = "PG_DATABASE_URL_USERS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/PG_DATABASE_URL_USERS"
                        },
                      - {
                          - name      = "REDIS_PORT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/REDIS_PORT"
                        },
                      - {
                          - name      = "REDIS_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/REDIS_URL"
                        },
                      - {
                          - name      = "SMTP_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-users/stage/SMTP_URL"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - environment       = [
                      - {
                          - name  = "DD_APM_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_APM_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_DOGSTATSD_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_LOGS_INJECTION"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_GRPC_ENDPOINT"
                          - value = "0.0.0.0:4317"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_HTTP_ENDPOINT"
                          - value = "0.0.0.0:4318"
                        },
                      - {
                          - name  = "DD_PROCESS_AGENT_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_PROFILING_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_RUNTIME_METRICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_TAGS"
                          - value = "env:stage app:api-users"
                        },
                      - {
                          - name  = "DD_TRACE_ANALYTICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ECS_FARGATE"
                          - value = "true"
                        },
                    ]
                  - essential         = true
                  - image             = "public.ecr.aws/datadog/agent:latest"
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-users-stage-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation = 128
                  - mountPoints       = []
                  - name              = "jfp-api-users-stage-datadog-agent"
                  - portMappings      = [
                      - {
                          - containerPort = 4317
                          - hostPort      = 4317
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4318
                          - hostPort      = 4318
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 8125
                          - hostPort      = 8125
                          - protocol      = "udp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
              - {
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - config-file-type        = "file"
                          - config-file-value       = "/fluent-bit/configs/parse-json.conf"
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "amazon/aws-for-fluent-bit:stable"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-users-stage-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation     = 100
                  - mountPoints           = []
                  - name                  = "jfp-api-users-stage-log-router"
                  - portMappings          = []
                  - systemControls        = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "jfp-api-users-stage" -> (known after apply)
      ~ revision                 = 43 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.stage.module.api-users.module.ecs-task.aws_ssm_parameter.parameters["GATEWAY_URL"] will be created
  + resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/api-users/stage/GATEWAY_URL"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "GATEWAY_URL"
        }
      + tags_all       = {
          + "name" = "GATEWAY_URL"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 4 to add, 6 to change, 5 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with module.datadog.datadog_integration_aws.sandbox,
│   on modules/aws/datadog/main.tf line 118, in resource "datadog_integration_aws" "sandbox":
│  118: resource "datadog_integration_aws" "sandbox" {
│ 
│ **This resource is deprecated - use the `datadog_integration_aws_account`
│ resource instead**:
│ https://registry.terraform.io/providers/DataDog/datadog/latest/docs/resources/integration_aws_account
╵
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/datadog.datadog_log_forwarder/modules/log_forwarder/main.tf line 2, in locals:
│    2:   bucket_name = var.bucket_name != "" ? var.bucket_name : "datadog-forwarder-${data.aws_caller_identity.current.account_id}-${data.aws_region.current.name}"
│ 
│ The attribute "name" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Error: Invalid index
│ 
│   on ../infrastructure/modules/aws/ecs-task/main.tf line 35, in resource "aws_ssm_parameter" "parameters":
│   35:   value     = data.doppler_secrets.app.map[each.key]
│     ├────────────────
│     │ each.key is "GATEWAY_URL"
│ 
│ The given key does not identify an element in this collection value.
╵

```
</details>